phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/config.h
/*
 * Phoenix-RTOS
 *
 * iMX RT multi driver config.
 *
 * Copyright 2019, 2024 Phoenix Systems
 * Author: Aleksander Kaminski, Hubert Buczynski
 *
 * This file is part of Phoenix-RTOS.
 *
 * %LICENSE%
 */


#ifndef _CONFIG_H_
#define _CONFIG_H_

#include "helpers.h"

#if defined(__CPU_IMXRT105X)
#include "imxrt1050.h"
#elif defined(__CPU_IMXRT106X)
#include "imxrt1060.h"
#elif defined(__CPU_IMXRT117X)
#include "imxrt1170.h"
#else
#warning "No target specified! Falling back to default"
#include "imxrt1060.h"
#endif

#include <board_config.h>

/*
 * In this config file, ISEMPTY() macro is used with tokens which are never
 * defined on their own as they are used later in token-paste macros (for
 * example: `ISEMPTY(UART1_TX_PIN)`). Thus, they will emit -Wundef warnings.
 * For a "temporary" workaround, they are silenced in this file.
 * Using #pragma only for ISEMPTY() macro definition is not enough.
 */
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wundef"

#ifndef IMXRT_MULTI_PRIO
#define IMXRT_MULTI_PRIO 2
#endif

/* UART */

#ifndef UART_BUFSIZE
#define UART_BUFSIZE 512
#endif


#ifndef UART1
#define UART1 0
#elif !ISBOOLEAN(UART1)
#error "UART1 must have a value of 0, 1, or be undefined"
#endif

#if UART1

#ifndef UART1_TX_PIN
#warning "[Deprecated] UART1_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART1_TX_PIN UART1_TX_PIN_DEFAULT
#elif ISEMPTY(UART1_TX_PIN)
#error "UART1_TX_PIN must not be empty"
#endif

#ifndef UART1_RX_PIN
#warning "[Deprecated] UART1_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART1_RX_PIN UART1_RX_PIN_DEFAULT
#elif ISEMPTY(UART1_RX_PIN)
#error "UART1_RX_PIN must not be empty"
#endif

#if UART1_HW_FLOWCTRL

#ifndef UART1_RTS_PIN
#warning "[Deprecated] UART1_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART1_RTS_PIN UART1_RTS_PIN_DEFAULT
#endif

#ifndef UART1_CTS_PIN
#warning "[Deprecated] UART1_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART1_CTS_PIN UART1_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART1_HW_FLOWCTRL */

#ifndef UART1_BUFSIZE
#define UART1_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART1_BUFSIZE)
#error "UART1_BUFSIZE must not be empty"
#endif

#ifndef UART1_BAUDRATE
#warning "[Deprecated] UART1_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART1_BAUDRATE 115200
#endif

#else
#define UART1_BAUDRATE 0
#define UART1_BUFSIZE  0
#endif /* #if UART1 */


#ifndef UART2
#define UART2 0
#elif !ISBOOLEAN(UART2)
#error "UART2 must have a value of 0, 1, or be undefined"
#endif

#if UART2

#ifndef UART2_TX_PIN
#warning "[Deprecated] UART2_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART2_TX_PIN UART2_TX_PIN_DEFAULT
#elif ISEMPTY(UART2_TX_PIN)
#error "UART2_TX_PIN must not be empty"
#endif

#ifndef UART2_RX_PIN
#warning "[Deprecated] UART2_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART2_RX_PIN UART2_RX_PIN_DEFAULT
#elif ISEMPTY(UART2_RX_PIN)
#error "UART2_RX_PIN must not be empty"
#endif

#if UART2_HW_FLOWCTRL

#ifndef UART2_RTS_PIN
#warning "[Deprecated] UART2_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART2_RTS_PIN UART2_RTS_PIN_DEFAULT
#endif

#ifndef UART2_CTS_PIN
#warning "[Deprecated] UART2_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART2_CTS_PIN UART2_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART2_HW_FLOWCTRL */

#ifndef UART2_BUFSIZE
#define UART2_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART2_BUFSIZE)
#error "UART2_BUFSIZE must not be empty"
#endif

#ifndef UART2_BAUDRATE
#warning "[Deprecated] UART2_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART2_BAUDRATE 115200
#endif

#else
#define UART2_BAUDRATE 0
#define UART2_BUFSIZE  0
#endif /* #if UART2 */


#ifndef UART3
#define UART3 0
#elif !ISBOOLEAN(UART3)
#error "UART3 must have a value of 0, 1, or be undefined"
#endif

#if UART3

#ifndef UART3_TX_PIN
#warning "[Deprecated] UART3_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART3_TX_PIN UART3_TX_PIN_DEFAULT
#elif ISEMPTY(UART3_TX_PIN)
#error "UART3_TX_PIN must not be empty"
#endif

#ifndef UART3_RX_PIN
#warning "[Deprecated] UART3_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART3_RX_PIN UART3_RX_PIN_DEFAULT
#elif ISEMPTY(UART3_RX_PIN)
#error "UART3_RX_PIN must not be empty"
#endif

#if UART3_HW_FLOWCTRL

#ifndef UART3_RTS_PIN
#warning "[Deprecated] UART3_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART3_RTS_PIN UART3_RTS_PIN_DEFAULT
#endif

#ifndef UART3_CTS_PIN
#warning "[Deprecated] UART3_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART3_CTS_PIN UART3_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART3_HW_FLOWCTRL */

#ifndef UART3_BUFSIZE
#define UART3_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART3_BUFSIZE)
#error "UART3_BUFSIZE must not be empty"
#endif

#ifndef UART3_BAUDRATE
#warning "[Deprecated] UART3_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART3_BAUDRATE 115200
#endif

#else
#define UART3_BAUDRATE 0
#define UART3_BUFSIZE  0
#endif /* #if UART3 */


#ifndef UART4
#define UART4 0
#elif !ISBOOLEAN(UART4)
#error "UART4 must have a value of 0, 1, or be undefined"
#endif

#if UART4

#ifndef UART4_TX_PIN
#warning "[Deprecated] UART4_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART4_TX_PIN UART4_TX_PIN_DEFAULT
#elif ISEMPTY(UART4_TX_PIN)
#error "UART4_TX_PIN must not be empty"
#endif

#ifndef UART4_RX_PIN
#warning "[Deprecated] UART4_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART4_RX_PIN UART4_RX_PIN_DEFAULT
#elif ISEMPTY(UART4_RX_PIN)
#error "UART4_RX_PIN must not be empty"
#endif

#if UART4_HW_FLOWCTRL

#ifndef UART4_RTS_PIN
#warning "[Deprecated] UART4_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART4_RTS_PIN UART4_RTS_PIN_DEFAULT
#endif

#ifndef UART4_CTS_PIN
#warning "[Deprecated] UART4_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART4_CTS_PIN UART4_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART4_HW_FLOWCTRL */

#ifndef UART4_BUFSIZE
#define UART4_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART4_BUFSIZE)
#error "UART4_BUFSIZE must not be empty"
#endif

#ifndef UART4_BAUDRATE
#warning "[Deprecated] UART4_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART4_BAUDRATE 115200
#endif

#else
#define UART4_BAUDRATE 0
#define UART4_BUFSIZE  0
#endif /* #if UART4 */


