phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/config.h
#if !ISEMPTY(UART_CONSOLE)
#if UART_CONSOLE <= 0
#error "Invalid value for UART_CONSOLE"
#endif
#endif

#if defined(UART_CONSOLE_USER)
#if !ISEMPTY(UART_CONSOLE_USER)
#if (UART_CONSOLE_USER <= 0)
#error "Invalid value for UART_CONSOLE_USER"
#endif
#endif
#else
#define UART_CONSOLE_USER UART_CONSOLE
#endif


#ifndef UART1_HALF_DUPLEX_GPIO
#define UART1_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART2_HALF_DUPLEX_GPIO
#define UART2_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART3_HALF_DUPLEX_GPIO
#define UART3_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART4_HALF_DUPLEX_GPIO
#define UART4_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART5_HALF_DUPLEX_GPIO
#define UART5_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART6_HALF_DUPLEX_GPIO
#define UART6_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART7_HALF_DUPLEX_GPIO
#define UART7_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART8_HALF_DUPLEX_GPIO
#define UART8_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART9_HALF_DUPLEX_GPIO
#define UART9_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART10_HALF_DUPLEX_GPIO
#define UART10_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART11_HALF_DUPLEX_GPIO
#define UART11_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif

#ifndef UART12_HALF_DUPLEX_GPIO
#define UART12_HALF_DUPLEX_GPIO .port = 0, .pin = 0, .onTx = 0
#endif


/* RTT */

#ifndef RTT0
#define RTT0 0
#elif !ISBOOLEAN(RTT0)
#error "RTT0 must have a value of 0, 1, or be undefined"
#endif

#ifndef RTT1
#define RTT1 0
#elif !ISBOOLEAN(RTT1)
#error "RTT1 must have a value of 0, 1, or be undefined"
#endif

#ifndef RTT0_BLOCKING
#define RTT0_BLOCKING 0
#elif !ISBOOLEAN(RTT0_BLOCKING)
#error "RTT0_BLOCKING must have a value of 0, 1, or be undefined"
#endif

#ifndef RTT1_BLOCKING
#define RTT1_BLOCKING 0
#elif !ISBOOLEAN(RTT1_BLOCKING)
#error "RTT1_BLOCKING must have a value of 0, 1, or be undefined"
#endif


#ifndef RTT_CONSOLE_USER
#define RTT_CONSOLE_USER
#elif !ISEMPTY(RTT_CONSOLE_USER)
#if RTT_CONSOLE_USER < 0
#error "Invalid value for RTT_CONSOLE_USER"
#endif
#endif

#if !ISEMPTY(UART_CONSOLE_USER) && !ISEMPTY(RTT_CONSOLE_USER)
#error "Console on both UART and RTT not supported"
#elif ISEMPTY(UART_CONSOLE_USER) && ISEMPTY(RTT_CONSOLE_USER)
#error "Console must be either on UART or RTT"
#endif

/* SPI */

#ifndef SPI1
#define SPI1 0
#elif !ISBOOLEAN(SPI1)
#error "SPI1 must have a value of 0, 1, or be undefined"
#endif

#if SPI1

#ifndef SPI1_SCK
#warning "[Deprecated] SPI1_SCK should be explicitly defined in board_config.h. Using the default"
#define SPI1_SCK SPI1_SCK_DEFAULT
#elif ISEMPTY(SPI1_SCK)
#error "SPI1_SCK must not be empty"
#endif

#ifdef SPI1_SD0
#warning "[Deprecated] SPI1_SDO (ending with letter O) should be used instead of SPI1_SD0 (ending with zero)"
#define SPI1_SDO SPI1_SD0
#endif

#ifndef SPI1_SDO
#warning "[Deprecated] SPI1_SDO should be explicitly defined in board_config.h. Using the default"
#define SPI1_SDO SPI1_SDO_DEFAULT
#elif ISEMPTY(SPI1_SDO)
#error "SPI1_SDO must not be empty"
#endif

#ifndef SPI1_SDI
#warning "[Deprecated] SPI1_SDI should be explicitly defined in board_config.h. Using the default"
#define SPI1_SDI SPI1_SDI_DEFAULT
#elif ISEMPTY(SPI1_SDI)
#error "SPI1_SDI must not be empty"
#endif

#ifndef SPI1_PCS0
#warning "[Deprecated] SPI1_PCS0 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI1_PCS0 SPI1_PCS0_DEFAULT
#endif

#ifndef SPI1_PCS1
#warning "[Deprecated] SPI1_PCS1 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI1_PCS1 SPI1_PCS1_DEFAULT
#endif

#ifndef SPI1_PCS2
#warning "[Deprecated] SPI1_PCS2 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI1_PCS2 SPI1_PCS2_DEFAULT
#endif

#ifndef SPI1_PCS3
#warning "[Deprecated] SPI1_PCS3 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI1_PCS3 SPI1_PCS3_DEFAULT
#endif

#endif /* #if SPI1 */


#ifndef SPI2
#define SPI2 0
#elif !ISBOOLEAN(SPI2)
#error "SPI2 must have a value of 0, 1, or be undefined"
#endif

#if SPI2

#ifndef SPI2_SCK
#warning "[Deprecated] SPI2_SCK should be explicitly defined in board_config.h. Using the default"
#define SPI2_SCK SPI2_SCK_DEFAULT
#elif ISEMPTY(SPI2_SCK)
#error "SPI2_SCK must not be empty"
#endif

#ifdef SPI2_SD0
#warning "[Deprecated] SPI2_SDO (ending with letter O) should be used instead of SPI2_SD0 (ending with zero)"
#define SPI2_SDO SPI2_SD0
#endif

#ifndef SPI2_SDO
#warning "[Deprecated] SPI2_SDO should be explicitly defined in board_config.h. Using the default"
#define SPI2_SDO SPI2_SDO_DEFAULT
#elif ISEMPTY(SPI2_SDO)
#error "SPI2_SDO must not be empty"
#endif

#ifndef SPI2_SDI
#warning "[Deprecated] SPI2_SDI should be explicitly defined in board_config.h. Using the default"
#define SPI2_SDI SPI2_SDI_DEFAULT
#elif ISEMPTY(SPI2_SDI)
#error "SPI2_SDI must not be empty"
#endif

#ifndef SPI2_PCS0
#warning "[Deprecated] SPI2_PCS0 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI2_PCS0 SPI2_PCS0_DEFAULT
#endif

#ifndef SPI2_PCS1
#warning "[Deprecated] SPI2_PCS1 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI2_PCS1 SPI2_PCS1_DEFAULT
#endif

#ifndef SPI2_PCS2
#warning "[Deprecated] SPI2_PCS2 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI2_PCS2 SPI2_PCS2_DEFAULT
#endif

#ifndef SPI2_PCS3
#warning "[Deprecated] SPI2_PCS3 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI2_PCS3 SPI2_PCS3_DEFAULT
#endif

#endif /* #if SPI2 */


#ifndef SPI3
#define SPI3 0
#elif !ISBOOLEAN(SPI3)
#error "SPI3 must have a value of 0, 1, or be undefined"
#endif

#if SPI3

#ifndef SPI3_SCK
#warning "[Deprecated] SPI3_SCK should be explicitly defined in board_config.h. Using the default"
#define SPI3_SCK SPI3_SCK_DEFAULT
#elif ISEMPTY(SPI3_SCK)
#error "SPI3_SCK must not be empty"
#endif

#ifdef SPI3_SD0
#warning "[Deprecated] SPI3_SDO (ending with letter O) should be used instead of SPI3_SD0 (ending with zero)"
#define SPI3_SDO SPI3_SD0
#endif

#ifndef SPI3_SDO
#warning "[Deprecated] SPI3_SDO should be explicitly defined in board_config.h. Using the default"
#define SPI3_SDO SPI3_SDO_DEFAULT
#elif ISEMPTY(SPI3_SDO)
#error "SPI3_SDO must not be empty"
#endif

#ifndef SPI3_SDI
#warning "[Deprecated] SPI3_SDI should be explicitly defined in board_config.h. Using the default"
#define SPI3_SDI SPI3_SDI_DEFAULT
#elif ISEMPTY(SPI3_SDI)
#error "SPI3_SDI must not be empty"
#endif

#ifndef SPI3_PCS0
#warning "[Deprecated] SPI3_PCS0 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI3_PCS0 SPI3_PCS0_DEFAULT
#endif

#ifndef SPI3_PCS1
#warning "[Deprecated] SPI3_PCS1 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI3_PCS1 SPI3_PCS1_DEFAULT
#endif

#ifndef SPI3_PCS2
#warning "[Deprecated] SPI3_PCS2 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI3_PCS2 SPI3_PCS2_DEFAULT
#endif

#ifndef SPI3_PCS3
#warning "[Deprecated] SPI3_PCS3 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI3_PCS3 SPI3_PCS3_DEFAULT
#endif

#endif /* #if SPI3 */


#ifndef SPI4
#define SPI4 0
#elif !ISBOOLEAN(SPI4)
#error "SPI4 must have a value of 0, 1, or be undefined"
#endif

