phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/config.h
#define I2C5 0
#define I2C6 0

#endif /* #ifdef __CPU_IMXRT117X */

#ifndef I2C1_PUSHPULL
#define I2C1_PUSHPULL 0
#endif

#ifndef I2C2_PUSHPULL
#define I2C2_PUSHPULL 0
#endif

#ifndef I2C3_PUSHPULL
#define I2C3_PUSHPULL 0
#endif

#ifndef I2C4_PUSHPULL
#define I2C4_PUSHPULL 0
#endif

#ifndef I2C5_PUSHPULL
#define I2C5_PUSHPULL 0
#endif

#ifndef I2C6_PUSHPULL
#define I2C6_PUSHPULL 0
#endif

#ifndef I2C1_SPEED
#define I2C1_SPEED i2c_speed_slow
#endif

#ifndef I2C2_SPEED
#define I2C2_SPEED i2c_speed_slow
#endif

#ifndef I2C3_SPEED
#define I2C3_SPEED i2c_speed_slow
#endif

#ifndef I2C4_SPEED
#define I2C4_SPEED i2c_speed_slow
#endif

#ifndef I2C5_SPEED
#define I2C5_SPEED i2c_speed_slow
#endif

#ifndef I2C6_SPEED
#define I2C6_SPEED i2c_speed_slow
#endif


/* TRNG */

#ifndef __CPU_IMXRT117X

#ifndef TRNG
#define TRNG 0
#elif !ISBOOLEAN(TRNG)
#error "TRNG must have a value of 0, 1, or be undefined"
#endif

#else

#ifdef TRNG
#error "TRNG is not available on IMXRT117x"
#endif

#define TRNG 0

#endif /* #ifndef __CPU_IMXRT117X */


/* Temperature */

#ifndef PCT2075
#define PCT2075 0
#elif !ISBOOLEAN(PCT2075)
#error "PCT2075 must have a value of 0, 1, or be undefined"
#elif !defined(PCT2075_BUS_NUM)
#error "PCT2075_BUS_NUM must be defined"
#elif !defined(PCT2075_DEV_ADDR)
#error "PCT2075_DEV_ADDR must be defined"
#endif


/* Cortex M4 */

#ifdef __CPU_IMXRT117X

#ifndef CM4
#define CM4 1
#elif !ISBOOLEAN(CM4)
#error "CM4 must have a value of 0, 1, or be undefined"
#endif

#else

#ifdef CM4
#error "CM4 is only available on IMXRT117x"
#endif

#define CM4 0

#endif /* #ifdef __CPU_IMXRT117X */


/* libdummyfs */

#ifndef BUILTIN_DUMMYFS
#define BUILTIN_DUMMYFS 0
#elif !ISBOOLEAN(BUILTIN_DUMMYFS)
#error "BUILTIN_DUMMYFS must have a value of 0, 1, or be undefined"
#endif


/* libposixsrv */

#ifndef BUILTIN_POSIXSRV
#define BUILTIN_POSIXSRV 0
#elif !ISBOOLEAN(BUILTIN_POSIXSRV)
#error "BUILTIN_POSIXSRV must have a value of 0, 1, or be undefined"
#endif

/* libcoredumpsrv */
#ifndef BUILTIN_COREDUMPSRV
#define BUILTIN_COREDUMPSRV 1
#endif


/* Pseudodev */

#ifndef PSEUDODEV
#define PSEUDODEV 0
#elif !ISBOOLEAN(PSEUDODEV)
#error "PSEUDODEV must have a value of 0, 1, or be undefined"
#endif


#pragma GCC diagnostic pop

#endif
